[
  {
    "title": "[Weekly Questions Thread] 11 September 2023",
    "author": "PokeUpdateBot",
    "link": "https://redd.it/16fuo09",
    "body": "**Have any questions about Pokémon that you'd like answered?**\n\n##If they're about the value of a piece of merchandise you own or found, please ask them in the **new** [Weekly Value Questions](https://rpkmn.center/weekly/value) thread!\n\nIf you're asking or answering questions about the new games or recent anime episodes which contain spoilers, please be sure to include spoiler tags around them using the format:\n\n`>!Spoiler goes here.!<`\n\nText wrapped in `>!` and `!<` is hidden until the reader c..."
  },
  {
    "title": "[Theme Talk] New Battle Facility!",
    "author": "darthvader1043",
    "link": "https://redd.it/16h7xp6",
    "body": "This is an /r/pokemon themed topic thread—look for new theme discussions on the sub every Wednesday!\n\n[Check out Opinion Wednesday on the /r/pokemon Discord Server to talk in real time!](https://discord.gg/pokemon)\n\n*****\n\n**Topic: New Battle Facility!**\n\nYou, person reading this! Game Freak has tasked you with creating a brand new, never-before-seen battle facility for the next generation of Pokemon! A battle facility is typically post-game content where trainers head to a location to engage in..."
  },
  {
    "title": "It’s probably been said before but…",
    "author": "PatrickHardcastle",
    "link": "https://redd.it/16iyj5j",
    "body": "I recently, briefly went back to Pokemon Shield and it’s extremely noticeable how much better everything looks. \n\nLike sure, it’s by no means the best looking game out there, not even close, but the environments generally have way more design to them, the towns naturally point you towards good angles, NPCs are better designed and the gym leaders are all enjoyable and, perhaps controversially, the music is much better.\n\nI can extend this to legends arceus, too. The skyboxes in that game are incre..."
  },
  {
    "title": "Type Combos You're Convinced That Will Never Happen",
    "author": "Blob55",
    "link": "https://redd.it/16inztb",
    "body": "Rock/Ghost considering how many times they screwed it up. We could have had one by now if Polteageist, Runrigus, Cursola or Stonjourner were one.\n\nIce/Fire since it's only linked to a specific Pokémon form with a specific ability.\n\nBug/Dragon, since Slither Wing, Flygon and Yanmega could have all easily been one...."
  },
  {
    "title": "About Ogerpon...",
    "author": "DivinityPen",
    "link": "https://redd.it/16j23fk",
    "body": "She is baby.  \nShe is utter perfection and I love her so much.   \nWhen I first saw what she looked like with the mask on, way back in the reveal trailer for Teal Mask, I was interested, but I wasn't sure if I was 100% sold. But the second the mask came off in the DLC cutscene, I realized that I would literally die for this child. It is physically impossible for me to not love that face. The little fangs and star pupils are really simplistic, but work so goddamn well. I feel like I'm losing my mi..."
  },
  {
    "title": "What Types do you always forget the Strengths and/or Weaknesses for?",
    "author": "CameronG95",
    "link": "https://redd.it/16itvoz",
    "body": "I've been playing Pokémon since Alpha Sapphire and Omega Ruby but gone back and played all the previous games so feel I have a pretty solid understanding of what is good against what but for some reason, I always forgot what Dark types are strong against and what Poison types are weak against.\n\nI think Dark types would be good against Fairy and that Poison types are weak against Steel...."
  },
  {
    "title": "I dun goofed..",
    "author": "Okami02",
    "link": "https://redd.it/16ilj73",
    "body": "So take this as a warning to anyone who is looking to transfer pokemon from Home to legit any game...\n\nFor context, im trying to complete the Kitakami dexs, and I am a few pokemon away. Real annoying ones that evolve in convoluted ways, like trading etc.\n\nAs im going through my Home, I noticed that Rayquaza was transferable into Violet. I thought \"Why not.\" Now if you are familiar with the move V-Create, you will know that it is a event only move. In other words, you will never be able to get V-..."
  },
  {
    "title": "I just had the most bizarre battle against a random trainer in the dlc",
    "author": "Flipnhaole",
    "link": "https://redd.it/16iznln",
    "body": "They had an Alolan Vulpix with snow cloak. They set snowscape. \n\nThey dodged a move. \nFroze and crit with freeze dry.\n I stayed frozen for two turns.\nDied to the third freeze dry.\nThey dodged a move. \nFroze with blizzard.\nI stayed frozen for 8 turns. \nThey hit all 3 other blizzards w/o snow. \n\nIdk what the chances of that happening are, but it has be less than one percent. I laughed out loud at the second freeze..."
  },
  {
    "title": "Which Game is better in 2023, Scarlet and Violet or Sword and Shield?",
    "author": "Dasher2058",
    "link": "https://redd.it/16in4c9",
    "body": "As someone who only played the DS Pokémon games, I really want to get into the newer titles. I've been putting a lot of thought into what game I should get and I'm torn between, The Sword and Shield titles and the Scarlet and Violet titles. SV looks a lot more buggy yet more fun and unique, ShSh looks like more of a classic Pokemon game, but seems to run far better. So because I can't make my own decision, I'd like to ask the community...."
  },
  {
    "title": "We need a Platypus Pokemon",
    "author": "darkKnight217",
    "link": "https://redd.it/16irdfa",
    "body": "When I googled platypus Pokemon, Psyduck keeps popping up but that's a duck isn't it?\n\nIt's description is weird enough to resemble something that came out of a Pokedex. Plus it looks like one. And I just found out male platypus have venomous hind claws? And apparently it has some sort of electric based super sixth sense with which it hunts!\n\nEven if Psyduck was loosely based on a Platypus, they could come up with a better one based on its true characteristics.\n\nType: Water, Poison, Electric?..."
  }
]