[
  {
    "title": "test post please ignore",
    "author": "Go_JasonWaterfalls",
    "link": "https://redd.it/sphocx",
    "body": "Hey everyone, [u/Go\\_JasonWaterfalls](https://www.reddit.com/u/Go_JasonWaterfalls/) here, Reddit’s VP of Community. Welcome to [r/reddit](https://www.reddit.com/r/reddit/)! You’re in the right place for all sorts of updates, announcements, and news related to Reddit Inc. and the platform.\n\n**TL;DR** Moving forward, the posts that you would normally read in admin communities such as [r/blog](https://www.reddit.com/r/blog/), [r/announcements](https://www.reddit.com/r/announcements/), and [r/change..."
  },
  {
    "title": "In Case You Missed It: August 2023 on Reddit",
    "author": "JabroniRevanchism",
    "link": "https://redd.it/16gx179",
    "body": "Ahoy there, Reddit!\n\nCommunities across Reddit have been busy this summer, from showcasing [user creativity](https://www.reddit.com/r/place/comments/15bjm5o/rplace_2023_data/) to chatting about this year’s hottest movies and video games – which seem to have been released all at once. We’re featuring a few of those trending communities in this post in addition to some other cool cats (both literal and otherwise) that you can find on Reddit…just in case you missed it.  \n\n**📈TRENDING COMMUNITIES**\n..."
  },
  {
    "title": "Changelog: Redesigned Help Center, post translations, and more",
    "author": "BrineOfTheTimes",
    "link": "https://redd.it/16cnyta",
    "body": "Greetings, y’all!\n\nThe seasons are changing, and so are some things on Reddit – which means… it’s officially Changelog time. Keep reading to learn about the redesigned Help Center, translations for Android/iOS, and more.\n\n**Redesigned Help Center**\n\nIn case you missed it, Reddit’s Help Center got a makeover! When visiting our main homepage, you’ll see two options: [Moderator Help Center](https://support.reddithelp.com/hc/p/mod_help_center) and [Redditor Help Center](https://support.reddithelp.co..."
  },
  {
    "title": "An Improved Logged-Out Web Experience",
    "author": "whizlogic",
    "link": "https://redd.it/15eobm3",
    "body": "TL;DR we’ve made improvements to *reddit.com to deliver a more consistent, reliable, and fast web experience for people not logged in. This experience is now available to everyone globally on desktop and mobile web.*\n\nHello all,\n\nI’m u/whizlogic, a product lead at Reddit focused on the performance, stability, and quality of our web platforms, and today I’m sharing an [update from our earlier post](https://www.reddit.com/r/reddit/comments/11zso11/an_improved_web_experience/) on improving the web ..."
  },
  {
    "title": "Changelog: \"Official\" labels, notification checks, and a peer-to-peer helper program",
    "author": "BrineOfTheTimes",
    "link": "https://redd.it/15aerd6",
    "body": "Howdy, Reddit. We’ve made it all the way to the end of July, which means it’s about time for another Changelog update. \n\nKeep reading to learn more about a new experiment around *Official* labels, notification checks, and our peer-to-peer helper program. \n\n**Testing an** ***Official*** **label** \n\nStarting today, we’re beginning early testing of placing a visual indicator on certain profiles to provide proof of authenticity, reduce impersonation, and increase transparency across the platform. Th..."
  },
  {
    "title": "Accessibility Improvements on iOS and Android",
    "author": "platinumpixieset",
    "link": "https://redd.it/15aa6ea",
    "body": "**TL;DR: In August, we’re improving the accessibility of our native Reddit apps – iOS and Android.** \n\nHi all, \n\nI’m u/platinumpixieset, a product lead at Reddit focused on improving accessibility. I’m honored to be a part of the accessibility team at Reddit and excited to share our plans with you all. \n\nWe have a lot of work to do to ensure everyone can access Reddit without barriers. Starting in August, prominent surfaces on iOS and Android will be compatible with your device’s screen reader. ..."
  },
  {
    "title": "Better late than never?",
    "author": "reddit_irl",
    "link": "https://redd.it/153vw8z",
    "body": "..."
  },
  {
    "title": "r/place is back (again)",
    "author": "reddit_irl",
    "link": "https://redd.it/154qutf",
    "body": "Word on the street is that many of you enjoyed r/place [last year](https://www.reddit.com/r/place/comments/txufad/the_complete_rplace_timelapse/) and in [2017](https://www.reddit.com/r/Art/comments/6393x4/rplace_digital_2017/) and wanted even more time on the canvas. So, we’re bringing it back.\n\nFinding the right [time](https://www.reddit.com/r/reddit/comments/153vw8z/better_late_than_never/) for [r/place ](https://www.reddit.com/r/place/)to return proved to be a challenge – but hey, what better..."
  },
  {
    "title": "Reworking Awarding: Changes to Awards, Coins, and Premium",
    "author": "venkman01",
    "link": "https://redd.it/14ytp7s",
    "body": "Hi all,\n\nI’m u/venkman01 from the Reddit product team, and I’m here to give everyone an early look at the future of how redditors award (and reward) each other. \n\n**TL;DR**: We are reworking how great content and contributions are rewarded on Reddit. As part of this, we made a decision to sunset [coins](https://reddit.zendesk.com/hc/en-us/articles/360043034252-What-are-Reddit-Coins-and-how-do-I-use-them-) (including Community coins for moderators) and [awards](https://reddit.zendesk.com/hc/en-us..."
  },
  {
    "title": "Changelog: Chat and flair navigation updates",
    "author": "BrineOfTheTimes",
    "link": "https://redd.it/14gb7xy",
    "body": "Hey y’all, it’s Changelog time.\n\nWe’ve got some updates for you on flair navigation and Chat. Keep reading to learn about what’s new.\n\n**Flair navigation on mobile**\n\nWe’re (finally) bringing content filtering to mobile, with a new post flair navigation experience. If you are a member of a community that has post flair navigation setup, you can now select a post flair to filter posts on the Reddit mobile app. It's a convenient way to quickly get to the content you want to see.\n\nThis experience w..."
  }
]