[
  {
    "title": "Official: [Index] - For All Your Team/League Questions - Fri Afternoon 09/15/2023",
    "author": "FFBot",
    "link": "https://redd.it/16jhep0",
    "body": "___\r\n\r\n###**PLEASE READ**\r\n\r\n* How to post a [Player Discussion](https://redd.it/52xkzc) or [Injury Thread](https://redd.it/2koxce) \r\n* [Sub Rules and Guidelines](http://www.reddit.com/r/fantasyfootball/wiki/rules_guidelines)  \r\n* [Our Wiki with tons of great content!](http://www.reddit.com/r/fantasyfootball/wiki/index)  \r\n* [FAQ](/r/fantasyfootball/wiki/faq) \r\n\r\n\r\n --- \r\n\r\n**[Play in our Weekly Accuracy Challenge](https://narffl.com/games/accuracy_challenge) sponsored by [FantasyPros](http://ww..."
  },
  {
    "title": "Fantasy Football is not worth going after players on social media",
    "author": "ScarecrowFighter2020",
    "link": "https://redd.it/16jduia",
    "body": "..."
  },
  {
    "title": "Justin Jefferson is just 24 years old and now has more career receiving yards than any Chicago Bears receiver in the team's history. All 100+ years of it.",
    "author": "BugOnARockInAVoid",
    "link": "https://redd.it/16j2o4i",
    "body": "..."
  },
  {
    "title": "D'Andre Swift saw 77.7% of Philly's running back rushes last night to go along with a 13.6% target share. No Philly back hit those marks (or better) in a single game last year. Miles Sanders was above a 70% RB rush share and 10% target share just once.",
    "author": "Sportsdude25",
    "link": "https://redd.it/16jchfx",
    "body": "..."
  },
  {
    "title": "Travis Kelce and Chris Jones will play for the Chiefs on Sunday in Jacksonville.",
    "author": "theplumbtrician",
    "link": "https://redd.it/16jke0l",
    "body": "..."
  },
  {
    "title": "Calvin Austin lll may be the biggest waiver wire sleeper",
    "author": "LordJackDaniels",
    "link": "https://redd.it/16jd1jd",
    "body": "Calvin Austin lll may be the biggest waiver wire sleeper, by far.\n\nWhen diontae went down with an injury, Austin filled in nicely with 6 targets 6 receptions. (2 targets before diontae injury/ 4 targets after) Has good versatility on the field/he lined up in the slot and outside. Has excellent route running and releases/ runs jets sweeps/ returns punts. in the 49ers game he made a defender fall on a drag route which made him wide open, would’ve been a td if Kenny saw him. (you can watch his rele..."
  },
  {
    "title": "Greg Beacham on X: “In college, they definitely weren’t hitting like that.” -Puka Nacua when I asked him yesterday how the hits he took in his NFL debut compared to the physical toll at Washington /BYU. He did say his ribs felt much better than they did Sunday or Monday.",
    "author": "Angiers_Clone",
    "link": "https://redd.it/16jaquu",
    "body": "..."
  },
  {
    "title": "Christian Watson (hamstring) went outside with the team after stretch but Aaron Jones (hamstring) did not. Quay Walker (concussion protocol) practicing for the second straight day. David Bakhtiari did not practice.",
    "author": "gw2380",
    "link": "https://redd.it/16jj3y6",
    "body": "..."
  },
  {
    "title": "Last year, Justin Jefferson had 50 points through the first two weeks. This year, he has 48. However, they came in two different ways. Which do you prefer?",
    "author": "OBJesus",
    "link": "https://redd.it/16jdpo5",
    "body": "This isn’t necessarily a Jefferson-centric post, more so curious how everyone prefers their players to score fantasy points. \n\nJefferson through the first two weeks, full PPR:\n**2022:**\n- Week 1: 39.4\n- Week 2: 10.80\n\n**2023:** \n- Week 1: 24\n- Week 2: 23.9\n\nDo you prefer your players to have roller-coaster explosive games or more consistency?..."
  },
  {
    "title": "Breece hall to remain on a pitch count",
    "author": "EngineFrog",
    "link": "https://redd.it/16jjgf9",
    "body": "..."
  }
]